import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

dataset = pd.read_csv('data.csv')

# میخوایم ببینیم فردی محصول مارو میخره یا نه.اون دیتا های مشتری بهش میگیم ویژگی  به اون تصمیم نهایی میگیم متغیر وابسته
# چون خب اون ستون آخر بستگی داره به اون دیتاهای کناریش

# پس ما دو متغیر میسازیم یکی ویژگی یا همون کلاس ها و یکی هم اون متغیر وابسته یا همون نتیجش

x = dataset.iloc[:, :-1].values
# اون شاخص ستون هارو میخوایم دریافت کنیم
# دو نقطه دو طرف خالی یعنی همه موارد ردیف ها
# بخش دوم هم یعنی همه ستون ها جز آخری
y = dataset.iloc[:,-1].values

print(x)
print(y)
# میخوایم داده هایی که خالی اند رو با میانگین بقیه داده های اون ستون پر کنیم
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(missing_values=np.nan , strategy='mean')
# یک شیء "ایمپیوتر" بساز
# اگر مقدار برابر NaN باشد،
# آن را با "میانگین" (mean) جایگزین کن.
imputer.fit(x[:,1:3])
# ستون‌های ورودی را بررسی کن و میانگین آن‌ها را حساب کن.
# چون ستون های 1 و 2 عددی هستن اون مقدارو داخل فیت نوشتیم.یعنی همه ردیف های ستون 1 و 2
x[:,1:3] = imputer.transform(x[:,1:3])
# حالا هر جا در این ستون‌ها NaN دیدی، آن را با میانگینی که در مرحله fit حساب کردی جایگزین کن.
print(x)
